ISWFoam/tutorial/FlatBottom-DJLES/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0.0 0.0 0.0)
    ( 15.0 0.0 0.0)
    ( 15.0 1.0 0.0)
    ( 0.0 1.0 0.0)
    ( 0.0 0.0 0.5)
    ( 15.0 0.0 0.5)
    ( 15.0 1.0 0.5)
    ( 0.0 1.0 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (750 1 200) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type    cyclic;
        neighbourPatch    outlet;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type cyclic;
	neighbourPatch    inlet;
        faces
        (
            (1 5 6 2)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
 
    top
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    front
    {
        type empty;
        faces
        (
            (0 1 5 4)
        );
    }
    back
    {
        type empty;
        faces
        (
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //

