ISWFoam/tutorial/FlatBottom-DJLES/0.orig/initialFieldsRho
densityProfile
List<scalar>
150000
(
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
1030.000000
...
)
;
