ISWFoam/tutorial/FlatBottom-DJLES/0.orig/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      deltaRho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

//internalField   uniform 0;

#include "initialFieldsRho";
internalField   nonuniform $densityProfile;

boundaryField
{
    inlet
    {
        type            cyclic;

    }

    outlet
    {
        type            cyclic;
    }

    ground
    {
        type            zeroGradient;
    }

    front
    {
	    type            empty;
    }
    back
    {
	    type            empty;
    }

    top
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
