ISWFoam/tutorial/FlatBottom-DJLES/Allrun
#! /bin/bash

decomposePar
mpirun -n 48 ISWFoam -parallel &>log

reconstructPar -time 0,1,2,3,4,5,10,20,30,40,50,60
foamToVTK
./postSensDensity.py
